---
kind: type
id: T:Autodesk.Revit.DB.IFailuresProcessor
source: html/34a78265-3a7d-ba7f-5467-764fc9efe619.htm
---
# Autodesk.Revit.DB.IFailuresProcessor

To create your own UI or fully automated tool to process Revit Failures, derive a class from this interface.

## Syntax (C#)
```csharp
public interface IFailuresProcessor
```

## Remarks
To override Revit default Failures Processing UI, instantiate your own processor derived from this interface
 and register it in Revit application.